[データサイエンスのためのPython入門12〜DataFrameの基本的な使い方\(head, describe, Seriesの取得など\)〜](https://datawokagaku.com/dataframe_howto_1/)

今回はですね、DataFrameの使い方を紹介していきたいと思います。

まずはいつものやつ、いってみましょう〜！

In [5]:
import numpy as np
import pandas as pd

では、さっそくCSVファイルに格納されたデータセットを読み込んでみましょう！前回のおさらいですね。

In [6]:
df = pd.read_csv('data/titanic/train.csv')

データセットを読み込んだ場合はですね、ほんとにちゃんと読み込めているかどうか、`df.head()`で必ず確認するようにしましょうね！引数をつけるとその分の行数が表示されますよ。

In [8]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

ちゃんと読み込めてますね〜。

では、次に統計量を確認してみます。`df.describe()`を使います。ドンッ！

In [9]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

ちなみに、`df.describe()`の返り値もDataFrameなんで、こっからさらにあれこれいじることもできますね。

次は、どういうcolumnがあるかを見ていきましょう。`df．columns`を使います。

In [11]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

返り値の`Index`という型は、`List`と同じように扱えます。たとえばslicingできたりしますよ。

In [12]:
df.columns[2:5]

Index(['Pclass', 'Name', 'Sex'], dtype='object')

第10回でみた通り、DataFrameの各行・各列はSeriesで構成されていますね。それらを取り出すには`[]`を使います。

In [13]:
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

型を見てみましょう。ジャンッ！

In [14]:
type(df['Age'])

pandas.core.series.Series

ちゃんとSeries型になってますね〜。

さらに、複数のカラムをまとめて抽出することもできちゃうんですね〜！便利！

In [16]:
df[['PassengerId', 'Age', 'Fare']].head()

   PassengerId   Age     Fare
0            1  22.0   7.2500
1            2  38.0  71.2833
2            3  26.0   7.9250
3            4  35.0  53.1000
4            5  35.0   8.0500

さて、さっきはカラムを取り出してみましたけれどもね、もちろん行も取り出せます！

ものは試し、とりあえず888行目を取り出してみましょうか。

In [17]:
df.iloc[888]

PassengerId                                         889
Survived                                              0
Pclass                                                3
Name           Johnston, Miss. Catherine Helen "Carrie"
Sex                                              female
Age                                                 NaN
SibSp                                                 1
Parch                                                 2
Ticket                                       W./C. 6607
Fare                                              23.45
Cabin                                               NaN
Embarked                                              S
Name: 888, dtype: object

888行目のレコードの`Age`カラムの値を取ることも出来ます。

In [23]:
df.iloc[888]['Age']

nan

`nan`って何だ〜〜！（笑）

冗談はさておき、これはNot a Numberの略で、実態は`np.nan`なんですね〜。

さて、ここからはDataFrameからあれこれデータを抽出してみましょう。

まずは、slicingで複数行を取得してみましょう。5〜9行目までの5レコードを取得するにはこう！

In [24]:
df.iloc[5:10]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

簡単ですね〜〜〜。

また、特定のカラムを落としたい場合というのがあったりしますね。`df.drop()`を使います。`axis`引数で行か列かを指定できますね。`0`の場合は行を、`1`なら列を表します。

1行目を落としてみましょう。

In [27]:
df.drop(0).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

今度はAgeカラムを落としてみます。

In [31]:
df.drop('Age', axis=1).head()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500,NaN,S

複数のカラムを落としたい場合はリストで渡せばOK！また、dropしても元の`df`の中身は変更されません！安心ですね〜。